app/controllers/api/v1/users_controller.rb

  def index
    begin
      respond_with User.all
---
SELECT `users`.* FROM `users`

  def show
    begin
      respond_with User.find(user_id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    begin
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `name`) VALUES ('sally.weimann@dare.name', '$2a$04$pXUFWJ3opBRXCmTRs0RKQex78KH9YMHON6aYNELNV4yD7OzELo06q', '2017-09-05 13:26:10', '2017-09-05 13:26:10', 'Farrah Fahey')

  def update
    begin
      if @user.update(user_params)
---
UPDATE `users` SET `email` = 'newmail@example.com' WHERE `users`.`id` = 1

  def destroy
    begin
      @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 1

  def set_user
    begin
      @user = User.find(user_id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1